In [56]:
#dependencies

import pandas as pd

In [57]:
#Use Pandas to read data
age_data = pd.read_csv("../Resources/Age_Data.csv")

In [58]:
#print to view
age_data.head()

   Unnamed: 0  Year        City        Age Range  Number in Range
0           0  2018  Albany, NY   18 to 24 Years            21091
1           1  2018  Albany, NY  75 Years & Over             5906
2           2  2018  Albany, NY   45 to 54 Years            10514
3           3  2018  Albany, NY    Under 5 Years             5491
4           4  2018  Albany, NY   65 to 74 Years             6670

In [59]:
#look for missing values
#awesome to see!
age_data.count()

Unnamed: 0         16236
Year               16236
City               16236
Age Range          16236
Number in Range    16236
dtype: int64

In [60]:
#get a list of all of our columns for easy reference
age_data.columns

Index(['Unnamed: 0', 'Year', 'City', 'Age Range', 'Number in Range'], dtype='object')

In [61]:
#collect data that includes year 2018 & age of 25-34
#'Year' = 2018
#'Age Range' = 25 t0 34 Years

age_data_2018_df = age_data.loc[(age_data["Year"] == 2018) & (age_data["Age Range"] == "25 to 34 Years")]

In [62]:
#print
age_data_2018_df

       Unnamed: 0  Year        City       Age Range  Number in Range
9               9  2018  Albany, NY  25 to 34 Years            15951
75             75  2018  Albany, NY  25 to 34 Years            15951
141           141  2018  Albany, NY  25 to 34 Years            15951
207           207  2018  Albany, NY  25 to 34 Years            15951
273           273  2018  Albany, NY  25 to 34 Years            15951
...           ...   ...         ...             ...              ...
15915       15915  2018   Tampa, FL  25 to 34 Years            69950
15981       15981  2018   Tampa, FL  25 to 34 Years            69950
16047       16047  2018   Tampa, FL  25 to 34 Years            69950
16113       16113  2018   Tampa, FL  25 to 34 Years            69950
16179       16179  2018   Tampa, FL  25 to 34 Years            69950

[246 rows x 5 columns]

In [69]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
age_data_2018_df.drop(columns=["Unnamed: 0"], inplace=True)

In [70]:
#drop duplicates!
#missed the first time
#use city as subset - since it varies
#add at end inplace=True -> to allow panda to edit the original DF
#inplace=False -> does not affect the original DF
age_data_2018_df.drop_duplicates(subset="City", keep="first", inplace=True)

In [71]:
#print
age_data_2018_df

       Year                             City       Age Range  Number in Range
9      2018                       Albany, NY  25 to 34 Years            15951
405    2018                      Atlanta, GA  25 to 34 Years           102941
1197   2018                   Boise City, ID  25 to 34 Years            34737
1593   2018                       Boston, MA  25 to 34 Years           171798
1989   2018                      Buffalo, NY  25 to 34 Years            47375
2385   2018                    Charlotte, NC  25 to 34 Years           157640
2781   2018                      Chicago, IL  25 to 34 Years           540134
3177   2018                   Cincinnati, OH  25 to 34 Years            58295
3573   2018                     Columbus, OH  25 to 34 Years           187258
3969   2018                       Dallas, TX  25 to 34 Years           249912
4365   2018                       Denver, CO  25 to 34 Years           167260
4761   2018                      Detroit, MI  25 to 34 Years           102047
5157   2018                 Grand Rapids, MI  25 to 34 Years            38939
5553   2018                   Harrisburg, PA  25 to 34 Years             8620
5949   2018                     Hartford, CT  25 to 34 Years            19964
6345   2018                      Houston, TX  25 to 34 Years           428263
6741   2018  Indianapolis city (balance), IN  25 to 34 Years           147293
7137   2018                 Jacksonville, FL  25 to 34 Years           149930
7533   2018                    Las Vegas, NV  25 to 34 Years            90715
7929   2018                  Los Angeles, CA  25 to 34 Years           732538
8325   2018                        Miami, FL  25 to 34 Years            80956
8721   2018                    Nashville, NC  25 to 34 Years              649
9117   2018                  New Orleans, LA  25 to 34 Years            69532
9513   2018                     New York, NY  25 to 34 Years          1500032
9909   2018                      Orlando, FL  25 to 34 Years            69245
10305  2018                 Philadelphia, PA  25 to 34 Years           301903
10701  2018                      Phoenix, AZ  25 to 34 Years           279670
11097  2018                   Pittsburgh, PA  25 to 34 Years            62762
11493  2018                     Portland, OR  25 to 34 Years           127379
11889  2018                      Raleigh, NC  25 to 34 Years            87433
12285  2018                     Richmond, VA  25 to 34 Years            47292
12681  2018                      Roanoke, VA  25 to 34 Years            15320
13077  2018                   Sacramento, CA  25 to 34 Years            96884
13473  2018                    San Diego, CA  25 to 34 Years           266772
13869  2018                San Francisco, CA  25 to 34 Years           207779
14265  2018                      Seattle, WA  25 to 34 Years           177548
14661  2018                      Spokane, WA  25 to 34 Years            35083
15057  2018                    St. Louis, MO  25 to 34 Years            60935
15453  2018                     Syracuse, NY  25 to 34 Years            22997
15849  2018                        Tampa, FL  25 to 34 Years            69950

In [72]:
#export DF into a .csv
age_data_2018_df.to_csv("2018_all_cities_age_data.csv")